package main

import (
	"fmt"
	"sync"
	"time"
)

type LeakyBucket struct {
	rate       float64 // 漏桶速率，单位请求数/秒
	capacity   int     // 漏桶容量，最多可存储请求数
	water      int     // 当前水量，表示当前漏桶中的请求数
	lastLeakMs int64   // 上次漏水的时间戳，单位秒
	mux        sync.Mutex
}

func NewLeakyBucket(rate float64, capacity int) *LeakyBucket {
	return &LeakyBucket{
		rate:       rate,
		capacity:   capacity,
		water:      0,
		lastLeakMs: time.Now().Unix(),
	}
}

func (lb *LeakyBucket) Allow() bool {
	now := time.Now().Unix()

	lb.mux.Lock()
	defer lb.mux.Unlock()

	elapsed := now - lb.lastLeakMs                       // 通过时间间隔来计算这段时间已经漏了多少水
	leakAmount := int(float64(elapsed) / 1000 * lb.rate) // 漏水速率就是 可以接受的请求量，漏的越快越多，能够加的水也是越多的，也就表示可以不被限量的请求越多

	// 这里是漏水逻辑，如果这段时间内漏的水大于之前有多少水，则表示水都漏光了，直接将水量设为0
	if leakAmount > 0 {
		if leakAmount > lb.water {
			lb.water = 0
		} else {
			lb.water -= leakAmount
		}
	}

	// 判断当前水量是否超过容量
	if lb.water > lb.capacity {
		lb.water-- // 如果超过容量，减去刚刚增加的水量
		return false
	}

	// 这里是桶里增加水量逻辑，没有限量则会加水，一个请求一个水
	// 没有限流，增加水量，设置通过时间，也就是最近漏水时间
	lb.water++

	lb.lastLeakMs = now
	return true
}

func main() {
	// 创建一个漏桶，速率为每秒处理3个请求，容量为4个请求
	leakyBucket := NewLeakyBucket(3, 4)

	// 模拟请求
	for i := 1; i <= 100; i++ {
		now := time.Now().Format("15:04:05")
		if leakyBucket.Allow() {
			fmt.Printf(now+"  第 %d 个请求通过\n", i)
		} else {
			fmt.Printf(now+"  第 %d 个请求被限流\n", i)
		}
		time.Sleep(200 * time.Millisecond) // 模拟请求间隔
	}
}

/*
16:23:52  第 1 个请求通过
16:23:52  第 2 个请求通过
16:23:52  第 3 个请求通过
16:23:52  第 4 个请求通过
16:23:52  第 5 个请求通过
16:23:53  第 6 个请求被限流
16:23:53  第 7 个请求通过
16:23:53  第 8 个请求被限流
16:23:53  第 9 个请求通过
16:23:53  第 10 个请求被限流
16:23:54  第 11 个请求通过
16:23:54  第 12 个请求被限流
16:23:54  第 13 个请求通过
16:23:54  第 14 个请求被限流
16:23:54  第 15 个请求通过
16:23:55  第 16 个请求被限流
16:23:55  第 17 个请求通过
16:23:55  第 18 个请求被限流
16:23:55  第 19 个请求通过
16:23:55  第 20 个请求被限流
16:23:56  第 21 个请求通过
16:23:56  第 22 个请求被限流
16:23:56  第 23 个请求通过
16:23:56  第 24 个请求被限流
16:23:56  第 25 个请求通过
16:23:57  第 26 个请求被限流
16:23:57  第 27 个请求通过
16:23:57  第 28 个请求被限流
16:23:57  第 29 个请求通过
16:23:57  第 30 个请求被限流
16:23:58  第 31 个请求通过
16:23:58  第 32 个请求被限流
16:23:58  第 33 个请求通过
16:23:58  第 34 个请求被限流
16:23:58  第 35 个请求通过
16:23:59  第 36 个请求被限流
16:23:59  第 37 个请求通过
16:23:59  第 38 个请求被限流
16:23:59  第 39 个请求通过
16:24:00  第 40 个请求被限流
16:24:00  第 41 个请求通过
16:24:00  第 42 个请求被限流
16:24:00  第 43 个请求通过
16:24:00  第 44 个请求被限流
16:24:01  第 45 个请求通过
16:24:01  第 46 个请求被限流
^[z16:24:01  第 47 个请求通过
16:24:01  第 48 个请求被限流
16:24:01  第 49 个请求通过
16:24:02  第 50 个请求被限流
16:24:02  第 51 个请求通过
16:24:02  第 52 个请求被限流
16:24:02  第 53 个请求通过
16:24:02  第 54 个请求被限流
16:24:03  第 55 个请求通过
16:24:03  第 56 个请求被限流
16:24:03  第 57 个请求通过
16:24:03  第 58 个请求被限流
16:24:03  第 59 个请求通过
16:24:04  第 60 个请求被限流
16:24:04  第 61 个请求通过
16:24:04  第 62 个请求被限流
16:24:04  第 63 个请求通过
16:24:04  第 64 个请求被限流
16:24:05  第 65 个请求通过
16:24:05  第 66 个请求被限流
16:24:05  第 67 个请求通过
16:24:05  第 68 个请求被限流
16:24:05  第 69 个请求通过
16:24:06  第 70 个请求被限流
16:24:06  第 71 个请求通过
16:24:06  第 72 个请求被限流
16:24:06  第 73 个请求通过
16:24:06  第 74 个请求被限流
16:24:07  第 75 个请求通过
16:24:07  第 76 个请求被限流
16:24:07  第 77 个请求通过
16:24:07  第 78 个请求被限流
16:24:07  第 79 个请求通过
16:24:08  第 80 个请求被限流

发现后面就是一个通过 一个不通过
*/
